backend/app/models/movimentacao.rb

UPDATE "armas" SET "emprestada" = 1, "updated_at" = '2025-03-04 13:41:11.091296' WHERE "armas"."id" = 2
UPDATE "armas" SET "emprestada" = 0, "updated_at" = '2025-03-02 12:48:40.494065' WHERE "armas"."id" = 3
---
  def update_arma_status
    if tipo == 'emprestimo'
      arma.update(emprestada: true)
    elsif tipo == 'devolucao'
      arma.update(emprestada: false)