backend/app/controllers/armas_controller.rb

SELECT "armas".* FROM "armas"
---
    def index
      armas = Arma.all

INSERT INTO "armas" ("modelo", "registro", "emprestada", "created_at", "updated_at") VALUES ('Modelo X', 'ABC123', 0, '2025-03-01 21:59:53.334101', '2025-03-01 21:59:53.334101') RETURNING "id"
---
    def create
      arma = Arma.new(arma_params)
      if arma.save

UPDATE "armas" SET "modelo" = 'Modelo YXZW', "registro" = 'CRUD1234', "emprestada" = 0, "updated_at" = '2025-03-01 22:09:34.121007' WHERE "armas"."id" = 3
---
    def update
      if @arma.update(arma_params)

DELETE FROM "armas" WHERE "armas"."id" = 2
---
    def destroy
      @arma.destroy

SELECT "armas".* FROM "armas" WHERE "armas"."id" = 2 LIMIT 1
---
    def set_arma
      @arma = Arma.find(params[:id])