backend/app/controllers/equipes_controller.rb

SELECT "equipes".* FROM "equipes"
---
    def index
      equipes = Equipe.all

INSERT INTO "equipes" ("nome", "created_at", "updated_at") VALUES ('Equipe A', '2025-03-01 21:44:04.025924', '2025-03-01 21:44:04.025924') RETURNING "id"
---
    def create
      equipe = Equipe.new(equipe_params)
      if equipe.save

UPDATE "equipes" SET "nome" = 'Equipe Atualizada', "updated_at" = '2025-03-01 21:45:41.544987' WHERE "equipes"."id" = 2
---
    def update
      if @equipe.update(equipe_params)

DELETE FROM "equipes" WHERE "equipes"."id" = 2
---
    def destroy
      @equipe.destroy

SELECT "equipes".* FROM "equipes" WHERE "equipes"."id" = 2 LIMIT 1
---
    def set_equipe
      @equipe = Equipe.find(params[:id])