backend/app/controllers/guardas_controller.rb

SELECT "equipes".* FROM "equipes" WHERE "equipes"."id" IN (3, 5)
SELECT "guardas".* FROM "guardas"
---
    def index
        guardas = Guarda.all.includes(:equipe)

INSERT INTO "guardas" ("nome_completo", "matricula", "numeracao_porte", "created_at", "updated_at", "equipe_id") VALUES ('Edenilson do Nascimento', '5678', '3029', '2025-03-02 20:09:28.452606', '2025-03-02 20:09:28.452606', 3) RETURNING "id"
---
    def create
      guarda = Guarda.new(guarda_params)
      if guarda.save

UPDATE "guardas" SET "nome_completo" = 'Maria Goretti Cardoso de Miranda', "matricula" = '9218392', "numeracao_porte" = 'CRUD8901', "updated_at" = '2025-03-04 13:39:37.040016', "equipe_id" = 1 WHERE "guardas"."id" = 3
---
    def update
      if @guarda.update(guarda_params)

DELETE FROM "guardas" WHERE "guardas"."id" = 3
---
    def destroy
      @guarda.destroy

SELECT "guardas".* FROM "guardas" WHERE "guardas"."id" = 2 LIMIT 1
---
    def set_guarda
      @guarda = Guarda.find(params[:id])