backend/app/controllers/movimentacoes_controller.rb

SELECT "armas".* FROM "armas" WHERE "armas"."id" IN (2, 6)
SELECT "movimentacaos".* FROM "movimentacaos"
---
  def index
    movimentacoes = Movimentacao.all.includes(:arma, :guarda)