backend/app/controllers/unidades_controller.rb

    def index
      unidades = Unidade.all
---
SELECT "unidades".* FROM "unidades"

    def create
      unidade = Unidade.new(unidade_params)
      if unidade.save
---
INSERT INTO "unidades" ("nome", "created_at", "updated_at") VALUES ('Unidade A', '2025-03-01 21:19:30.541212', '2025-03-01 21:19:30.541212') RETURNING "id"

    def update
      if @unidade.update(unidade_params)
---
UPDATE "unidades" SET "nome" = 'Unidade Atualizada', "updated_at" = '2025-03-01 21:21:38.611658' WHERE "unidades"."id" = 1

    def destroy
      @unidade.destroy
---
DELETE FROM "unidades" WHERE "unidades"."id" = 1

    def set_unidade
      @unidade = Unidade.find(params[:id])
---
SELECT "unidades".* FROM "unidades" WHERE "unidades"."id" = 2 LIMIT 1