backend/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "password_digest", "first_login", "created_at", "updated_at", "temporary_password", "plaintext_password") VALUES ('Matheus', 'matheus.cardoso7@gmail.com', '$2a$12$PSeCq3CBGAPjKhMS/L1BR.Ni9byi5JUk/w4/qOqDsCmgAMLXOqPLS', 1, '2025-03-04 12:59:28.558771', '2025-03-04 12:59:28.558771', 'oDbFjRfG', NULL) RETURNING "id"
---
    def create
      provisional_password = SecureRandom.alphanumeric(8)
      user = User.new(user_params.merge(
        password: provisional_password,
        password_confirmation: provisional_password,
        temporary_password: provisional_password
      ))
      user.first_login = true if user.first_login.nil?

      if user.save

SELECT "users".* FROM "users" WHERE "users"."id" = 6 LIMIT 1
UPDATE "users" SET "password_digest" = '$2a$12$qA6ASSyj4UONcoCic/FdQuUiFZbMHZJVyZZRdwIy.35KAXpgNWqLG', "first_login" = 0, "updated_at" = '2025-03-04 13:17:29.503340', "temporary_password" = NULL, "plaintext_password" = 'cardoso1910' WHERE "users"."id" = 7
---
    def update_password
      user = User.find(params[:id])
      if user.update(password: params[:password],
                     password_confirmation: params[:password],
                     first_login: false,
                     temporary_password: nil,
                     plaintext_password: params[:password])